Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: འདུས་མ་བྱས་པ་ཐོབ་པ་ལ་ཡང་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་སྒྲིབ་པ་མེད་དེ།
en: Even though they attain the unconditioned, they are not obscured by unconditioned phenomena.

source: དེར་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཞེས་བྱའོ།
en: Wisdom that is not obscured in these ways is known as the bodhisattva’s seeing with unobscured wisdom.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་སྤྱོད་པ་དང་། བསམ་པ་དང་ཆོ་ག་ཤེས་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have four qualities, they will understand the conduct, intentions, and manner of all beings.

source: འཇིག་རྟེན་གྱི་རྗེས་སུ་འཇུག་པའི་ཤེས་པ་དང་། སྙོམས་པར་འཇུག་པ་ལ་མཁས་པའི་ཤེས་པ་དང་། ཤེས་པ་དང་། བསམ་པ་ལས་སུ་རུང་བའི་བསམ་པ་དང་། སེམས་ལ་དབང་བྱེད་པའི་ཐབས་ཏེ།
en: They are knowledge that accords with the world, knowledge of being skilled in the meditative attainments, intention that is pliable in knowledge and thought, and the means to master the mind.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་སྤྱོད་པ་དང་། བསམ་པ་དང་ཆོ་ག་ཤེས་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these four qualities, they will understand the conduct, intentions, and manner of all beings.

source: །ཀླུའི་བདག་པོ་ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have five qualities, they will be capable of ripening beings.

source: བདག་གི་བདེ་བ་ལ་མི་ལྟ་བས་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། བརྩོན་པ་བརྟན་པས་སེམས་ཅན་ལ་བདེ་བ་སྦྱིན་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་ཇི་ལྟ་བ་དེ་ལྟ་བུའི་སྤྱོད་པ་ལ་རྗེས་སུ་འཇུག་པ་དང་། གོང་དུ་ཡང་ཡོན་ཏན་ཁྱད་པར་ཅན་ལ་ཡང་འགོད་པར་བྱེད་པ་སྟེ།
en: They are being unremitting by disregarding one’s own happiness, giving happiness to beings by being consistent in one’s endeavors, being deeply compassionate, acting in harmony with the behavior of beings, and bringing out the highest qualities.

source: ཀླུའི་བདག་པོ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these five qualities, they will be capable of ripening beings.

source: །ཀླུའི་བདག་པོ་ཆོས་དྲུག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འཛིན་པ་དང་། ཀློག་པ་དང་། བརྡ་སྤྲོད་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have six qualities, they will be skilled in retention, recitation, and explanation.

source: གཟུངས་ཐོབ་པ་དང་། དྲན་པ་དང་ཤེས་བཞིན་གྱིས་སྒྲུབ་པ་དང་། ཡང་དག་པ་ལ་ཚུལ་བཞིན་དུ་འཇུག་པ་དང་། སེམས་ཀྱི་རྗེས་སུ་འཇུག་པ་ཤེས་པ་དང་། ཐོགས་པ་མེད་པའི་སྤོབས་པ་ཐོབ་པ་དང་། དགོངས་པའི་ཚིག་སྟོན་པའི་ཤེས་པ་ལ་མཁས་པ་སྟེ།
en: They are attaining recollection, practicing with mindfulness and awareness, appropriately engaging with the truth, knowing the mind’s pursuits, achieving unobstructed eloquence, and being skilled in the knowledge that teaches intentional statements.

source: ཀླུའི་བདག་པོ་ཆོས་དྲུག་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འཛིན་པ་དང་། ཀློག་པ་དང་། བརྡ་སྤྲོད་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these six qualities, they will be skilled in retention, recitation, and explanation.

source: །ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have eight qualities, they will defeat opposition from māras.

source: སྒྱུ་མའི་ཆོས་ཉིད་ཕུང་པོ་ལྔ་ཡོངས་སུ་ཤེས་པ་དང་ཡང་ལྡན་ལ་འཇིག་ཚོགས་ལ་ལྟ་བའི་ཉོན་མོངས་པ་དང་བྲལ་ཏེ། སྟོང་པ་ཉིད་ལ་སྤྱོད་ཡུལ་བ་ཡང་ཡིན་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་མེད་པར་ཡང་རབ་ཏུ་ཤེས་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསམས་བཞིན་དུ་སྐྱེ་བར་ཡང་བྱེད་པ་དང་། བརྩོན་འགྲུས་བརྟན་པས་བྱང་ཆུབ་ཀྱི་བསམ་པ་ཡང་ཡོངས་སུ་མི་གཏོང་ལ་ཁམས་གསུམ་པས་ཀྱང་ཡིད་རྟག་ཏུ་སྐྲག་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ཡང་མི་ལྟུང་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཡོངས་སུ་ཚོལ་བ་དང་། སེམས་ཅན་རྣམས་ལ་ཡང་ལྟ་ལ། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱང་སོགས་པ་དང་། མི་རྟག་པའི་མཚན་ཉིད་ལ་ཡང་ཡིད་ཆེས་ལ་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱང་སོགས་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཤེས་པ་ལ་ཡང་མ་ཆགས་པ་སྟེ།
en: They are freedom from being afflicted by personalistic false views through knowing the illusory nature of the five aggregates, the experience of emptiness, taking rebirth intentionally in order to ripen beings while knowing all conditioned things to be unborn, being eternally wary of the three realms while having a firm diligence that never gives up the mind set on awakening, pursuing omniscient wisdom without lapsing into premeditated performance, gathering the accumulation of merit while considering beings, gathering the accumulation of wisdom while trusting in the characteristic of impermanence, and avoiding attachment to the knowledge of the hearers and solitary buddhas.

source: ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these eight qualities, they will defeat opposition from māras.

source: །ཀླུའི་བདག་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྲག་པ་དང་འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have ten qualities, they will give up fear and anxiety and live the bodhisattva way of life.

source: སྦྱིན་པས་ཉེ་བར་བརྟན་པ་ཡིན་ཏེ་མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ་དང་། ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན་ཏེ་ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་གཅད་པ་དང་། བཟོད་པའི་གོ་ཆ་བགོས་པ་ཡིན་ཏེ་དབང་པོ་མ་ཉམས་པ་དང་། བརྩོན་འགྲུས་བརྟན་པ་ཡིན་ཏེ་དགེ་བའི་རྩ་བའི་ཚོགས་རྣམས་ཀྱིས་ཆོག་མི་ཤེས་པ་དང་། བསམ་གཏན་ལ་གནས་པ་ཡིན་ཏེ་ཅང་ཤེས་ཀྱི་སེམས་དང་ལྡན་པ་དང་། ཤེས་རབ་དང་ལྡན་པ་ཡིན་ཏེ་ཉོན་མོངས་པ་དང་བྲལ་བ་དང་། ཐབས་ལ་མཁས་པ་ཡིན་ཏེ་ཀུན་ཏུ་ཡོངས་སུ་བསྔོ་བ་ཤེས་པ་ལ་མཁས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་ཡིན་ཏེ་དོན་དང་ཆོས་དང་། ངེས་པའི་ཚིག་དང་སྤོབས་པ་ལ་མཁས་པ་དང་། གཟུངས་ཐོབ་པ་ཡིན་ཏེ།
en: being stable in diligence and being insatiable in the accumulation of roots of virtue; practicing concentration and having a refined mind; having insight and eliminating the afflictions; being skilled in means and being knowledgeable about dedication; attaining the correct discriminations and thus being skilled in meaning, qualities, expression, and eloquence;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་པ་ལ་མཁས་པ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་པ་ཡིན་ཏེ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་སྟེ།
en: achieving recollection and thus being skilled in cutting through the doubts of beings; and being blessed by the buddhas and upholding the Dharma.

source: ཀླུའི་བདག་པོ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྲག་པ་དང་འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these ten qualities, they will give up fear and anxiety and live the bodhisattva way of life.

source: །ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་ཡང་དག་པར་གཞོལ་བ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have eight qualities, they will apply themselves to the irreversible Dharma.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། བདག་གི་འཁྲུལ་པ་ལ་སོ་སོར་རྟོག་པར་བྱེད་ཀྱི། གཞན་གྱི་འཁྲུལ་པ་ལ་མི་རྟོག་པ་དང་། སྲོག་གི་ཕྱིར་ཡང་གཞན་དག་ལ་བརྙས་པར་མི་བྱེད་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་ཐོབ་པས་ཀྱང་མཐོ་བར་མི་འཛིན་ལ་མ་ཐོབ་པས་ཀྱང་དམའ་བར་མི་འཛིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཡོན་གནས་ཀྱི་སེམས་བསྐྱེད་དེ་སྦྱིན་པ་སྦྱིན་པ་དང་། བགོ་བཤའི་ངང་ཚུལ་ཅན་ཡིན་ཏེ། ཆོས་ལ་སློབ་དཔོན་དཔེ་མཁྱུད་མི་བྱེད་པ་དང་། གཞན་གྱི་བདེ་བས་དགའ་བ་ཡིན་ཏེ་ཕྲག་དོག་དང་སེར་སྣ་དང་བྲལ་བ་དང་། སྡུག་པ་དང་མི་སྡུག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ལ་འགྱོད་པ་མེད་པ་སྟེ།
en: They are practicing what one preaches, analyzing one’s own error and not being concerned with others’ confusion, not criticizing others even when one’s life is at stake, not thinking of oneself as high even if one becomes rich and honored and not thinking of oneself as lowly if one is not rich and honored, giving generously while developing the intention to be the patron of all beings, not being tightfisted in teaching the Dharma but instead having a spirit of sharing, delighting in happiness and avoiding jealousy and stinginess, and giving up everything—whether beautiful or ugly—without regret.

source: ཀླུའི་བདག་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་ཡང་དག་པར་གཞོལ་བ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these eight qualities, they will genuinely pursue the irreversible Dharma.

source: །ཀླུའི་བདག་པོ་ཆོས་ལྔ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have five qualities, they will never turn back from unsurpassed and perfect awakening.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ཡིན་ཏེ་ཐབས་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་ལ་མཁས་པ་ཡིན་ཏེ་ཆོས་ཟབ་མོའི་ཚུལ་ལ་གནས་པ་དང་། མངོན་པར་ཤེས་པ་མ་ཉམས་པ་ཡིན་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་རིག་པའི་ཆོ་ག་ཤེས་པ་དང་། ལེགས་པར་ཁོང་དུ་ཆུད་པ་ཤེས་པ་ཡིན་ཏེ་ཆགས་པ་མེད་པར་སྤྱོད་པ་དང་། ཟད་མི་ཤེས་པ་མངོན་པར་སྒྲུབ་པས་ཀྱང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་སྤྱོད་པར་བྱེད་ལ་ཟག་པ་ཐམས་ཅད་ཀྱང་ཟད་པར་བྱེད་པ་སྟེ།
en: They are being skilled in means by mastering all the perfections, being learned in the nature of all phenomena while adhering to the profound Dharma, being unimpaired in the higher knowledges while having knowledge of the workings of the faculties of all beings, acting without attachment while gaining true understanding, and acting according to dependent origination and exhausting all defilements even though one has accomplished the state beyond defilement.

source: ཀླུའི་བདག་པོ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these five qualities, they will never turn back from unsurpassed and perfect awakening.

source: །ཀླུའི་བདག་པོ་ཆོས་གསུམ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas have three qualities, they will attain acceptance.

source: སེམས་ཅན་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་བ་དག་མེད་པ་དང་། ཆོས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་དབེན་པ་དང་། ཡེ་ཤེས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆགས་པ་མེད་པ་སྟེ་གསུམ་པོ་དེ་དག་གོ།
en: They are selflessness in order to purify sentient beings, disengagement in order to purify phenomena, and nonattachment in order to purify wisdom. These are the three.

source: །གཞན་ཡང་གསུམ་སྟེ། སྔོན་གྱི་མཐའ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་མི་ཟད་པའི་ཆོས་ཉིད་དང་། ཕྱི་མའི་མཐའ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ཉིད་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ལེགས་པར་གནས་པའི་ཆོས་ཉིད་དེ།
en: Another three are the fact of being unending so that the past may be purified, the fact of being unborn so that the future may be purified, and the fact of persistence so that the phenomena of the present may be purified.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཆོས་གསུམ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐོབ་པ་ཡིན་ཏེ།
en: “Nāga Lord, if bodhisattvas possess an alternate set of three qualities, they will reach acceptance.

source: ལུས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་བསོད་ནམས་ཀྱིས་ཉེ་བར་བརྟན་པ་དང་། ངག་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡེ་ཤེས་མཐའ་ཡས་པ་དང་། སེམས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་ལ་དམིགས་པ་སྟེ།
en: They are stability in merit in order to purify the body, limitless wisdom in order to purify the speech, and a focus on absorption in order to purify the mind.

source: ཀླུའི་བདག་པོ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པ་ཡིན་ནོ།
en: Nāga Lord, if bodhisattvas have these three qualities, they will reach acceptance.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ལུང་སྟོན་པར་མཛད་དེ།
en: “Nāga Lord, if bodhisattvas have four qualities, they will be prophesied by the blessed buddhas.

source: ཆོས་རྣམས་ལ་ལྷག་པའི་བསམ་པས་སྒྲུབ་པ་དང་། དཀར་པོ་རྣམ་པར་མཐོང་བས་སྤྱོད་པ་ལ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པ་དང་། སེམས་ཅན་གྱི་བསམ་པ་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐོབ་པ་དང་། ཤིན་ཏུ་མེད་པའི་ཕྱིར་རང་བཞིན་གྱིས་མ་སྐྱེས་མ་བྱུང་བའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས་པ་སྟེ།
en: They are mastering all qualities with pure motivation, mastering conduct with an awareness of what is good, being able to arouse the strength of wisdom to respond to the wishes of beings, and understanding that phenomena are innately unborn and unarisen because they do not exist at all.

source: ཀླུའི་བདག་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ལུང་སྟོན་པར་མཛད་དོ།
en: Nāga Lord, if bodhisattvas have these four qualities, they will be prophesied by the blessed buddhas.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: When this teaching was given, one trillion two hundred billion gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans developed the mind set on unsurpassed and perfect awakening.

source: །བྱང་ཆུབ་སེམས་དཔའ་བདུན་ཁྲི་ཉིས་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་བོ།
en: Seventy-two thousand bodhisattvas reached acceptance that phenomena are unborn.

source: །དགེ་སློང་ཁྲི་བཞི་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: Fourteen thousand monks purified the stainless and immaculate Dharma eye that sees phenomena.

source: །དགེ་སློང་མ་བརྒྱད་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: The minds of eight thousand nuns were freed from defilements without any further appropriation.

source: །ལྷའི་བུ་ལྔ་སྟོང་གིས་ནི་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་བོ།
en: Five thousand gods were freed from attachment.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་དེའི་ཚེ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །འཇིག་རྟེན་ཡང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་བབ་བོ།
en: The worlds of the great trichiliocosm quaked in six ways, and the world was filled with a bright light as flowers rained from the sky.

source: །ལྷའི་བུ་རྣམས་ཀྱིས་ཀྱང་བར་སྣང་ལས་སིལ་སྙན་བརྒྱ་སྟོང་དག་དཀྲོལ་ཏེ་ཆེད་དུ་བརྗོད་པ་འདི་སྐད་ཀྱང་ཆེད་དུ་བརྗོད་དེ།
en: Then in the sky above, the gods played hundreds of thousands of instruments and proclaimed, “Amazing!

source: ཨ་ལ་ལ་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་པ་བསྐོར་བ་འདི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་བསྐོར་ཏོ།
en: The Thus-Gone One has turned the second turning of the Dharma wheel with this Dharma teaching.

source: །ཡུལ་བཱ་རཱ་ཎ་སཱི་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་སུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་གང་ཡིན་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་བསྐོར་བ་གང་ཡིན་པ་འདི་ནི་མཚུངས་སོ།
en: The turning of this Dharma teaching is similar to the turning of the Dharma wheel in the Deer Park at Ṛṣivadana near Vārāṇasī.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: འདི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པའི་དོན་མཛད་པའི་ཕྱིར་རོ།
en: Because this Dharma teaching is given for the benefit of countless beings.

source: །གཞན་ཡང་སེམས་ཅན་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་ངན་ངོན་མ་ཡིན་པ་དང་ལྡན་པ་ཡིན་ན་སེམས་ཅན་གང་དག་ཐོས་ནས་ཀྱང་འཆང་བར་བྱེད་པ་ལྟ་ཅི་སྨོས་ཏེ།
en: Moreover, since everyone who has simply heard this Dharma teaching has attained considerable roots of virtue, what need is there to mention those who will also recollect it?

source: དེ་དག་གིས་ནི་མིར་སྐྱེ་བ་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: They will be fortunate enough to attain human rebirths.

source: །དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཐོང་ངོ་།
en: They will behold the Thus-Gone One.

source: །དེ་དག་གིས་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེགས་པར་ཐོས་སོ།
en: They will hear this Dharma teaching.

source: །ཆོས་ཀྱི་ཚུལ་གྱི་རྣམ་པ་འདི་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་གང་ཡིན་པ་དེ་དག་གི་ངན་སོང་ཐམས་ཅད་ནི་བཀག་པར་གྱུར་ཏོ།
en: All those who have heard this expression of the Dharma and developed the mind set on unsurpassed and perfect awakening have blocked all the lower realms.

source: །དེ་དག་གི་ལྷ་དང་མིར་སྐྱེ་བའི་སྒོ་རྣམས་ནི་ཕྱེ་བར་གྱུར་ཏོ།
en: They have opened the doorways to rebirth among the humans and gods.

source: །དེ་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཟིན་པར་རིག་པར་བྱའོ།
en: Let it be known that they will inevitably pass beyond suffering.”

source: །ཞེས་བརྗོད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། གྲོགས་པོ་དག་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One then expressed his agreement with these gods, saying, “Friends, excellent, excellent.

source: །ཁྱེད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་སོ།
en: You have chosen your words well.

source: །མདོ་སྡེའི་ཚིག་བསྟན་པ་འདི་ལྟ་བུ་དག་ལ་དགའ་བ་ཐོབ་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་པ་དང་། ཐེག་པ་ཆེན་པོས་འདུལ་བ་ཡིན་ནོ།
en: Any being that appreciates the words taught in this sūtra will be blessed by the buddhas and tamed by the Great Vehicle.

source: །སེམས་ཅན་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་ཐུགས་སུ་ཆུད་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་ཕྱག་རྒྱས་བཏབ་པ་ཡིན་ནོ།
en: Such beings will gain the understanding of the wisdom of buddhahood and will be stamped with the seal of irreversibility.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དགའ་བ་ཐོབ་པ་གང་ཡིན་པའི་སེམས་ཅན་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འབའ་ཞིག་ལ། ཡང་དག་པར་གཞོལ་བ་མ་གཏོགས་པ་དེ་དག་འགྲོ་བ་གཞན་དུ་འགྲོ་བར་མི་འགྱུར་ན་གང་དག་བསྔགས་པ་ཐོས་ནས་འཛིན་པར་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་རྣམས་ལྟ་ཅི་སྨོས།
en: If beings who delight in this Dharma teaching will attain nothing less than the wisdom of the thus-gone ones, what need is there to speak of those who hear it praised, receive it, and practice it authentically?

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ལས་གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།།
en: Chapter One: The Setting

source: །།བམ་པོ་གཉིས་པ། དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བཤད་པ་འདི་ཐོས་ནས། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: When Nāga King Sāgara heard this, he was satisfied, elated, happy, delighted, joyful, and at ease.

source: རྒྱ་མཚོའི་གནས་རྣམ་པར་དག་པར་བྱེད་པའི་རིན་པོ་ཆེའི་བཀོད་པ་ཀུན་ཏུ་འོད་ཟེར་འབྱུང་བའི་འོད་ཅན་ཞེས་བྱ་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རི་བ་གང་ཡིན་པ་དེ་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་དགབ་པར་ཕུལ་ལོ།
en: As a shelter for the Dharma, he offered the Blessed One a large jewel called the gem that purifies the ocean with bright light , whose value matched that of the entire trichiliocosm.

source: །ནོར་བུ་རིན་པོ་ཆེ་དེའི་འོད་ཀྱིས་ཀྱང་ཉི་མ་དང་ཟླ་བ་གཉིས་ཀྱི་འོད་མོག་མོག་པོར་བྱས་སོ།
en: The light of this precious gem eclipsed even that of the sun and the moon.

source: །འཁོར་ཐམས་ཅད་ཀྱང་ངོ་མཚར་དུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཞིང་ཚིག་འདི་སྐད་དུ་ཨ་ལ་ལ་སངས་རྒྱས་བྱུང་བ་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: The entire assembly was astonished and prostrated to the Blessed One, announcing, “The appearance of a buddha is amazing.

source: དེ་བྱུང་བས་ནི་འདི་ལྟར་ཡ་མཚན་དུ་རུང་ཞིང་རྨད་དུ་བྱུང་བའི་ཆོས་དག་ཀྱང་སྣང་ངོ་ཞེས་སྨྲས་སོ།
en: When a buddha appears, such amazing things as this are possible, and marvelous Dharma teachings also appear.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དགབ་པ་བྱས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Once Nāga King Sāgara had covered the Blessed One, he said, “Blessed One, through this root of virtue may I attain the immaculate light that radiates from a buddha’s body!

source: །བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་སངས་རྒྱས་ཀྱི་སྐུའི་འོད་དྲི་མ་མ་མཆིས་པ་ཐོབ་པར་གྱུར་ཅིག །འོད་དེས་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་གྱུར་ཅིག །སེམས་ཅན་གང་ལ་འོད་དེས་ཕོག་པ་དེ་དག་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་གནོད་པར་མ་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པའི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ཡང་བདག་གིས་ཐོབ་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་ལམ་ཤེས་པ་སྒྲིབ་པ་མ་མཆིས་པ་ཡང་ཐོབ་པར་གྱུར་ཅིག །ལམ་ཤེས་པ་དེས་ཀྱང་སེམས་ཅན་ལམ་ལོག་པ་ལ་ཞུགས་པ་རྣམས་ཡང་དག་པའི་ལམ་ལ་འགོད་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་གཞན་ཡང་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མུན་པ་མུན་ནག་དང་བྲལ་ཏེ།
en: May this light illuminate all the buddha realms of the ten directions! May any being struck by this light be no longer harmed by any afflictive emotion! May I also obtain an ūrṇā hair between the eyebrows, just like the Thus-Gone One. May I attain unobscured understanding of the path to awakening! Knowing the path, may I bring everyone who is on a mistaken path onto the true path!

source: ལམ་ཤེས་པ་ཐོབ་པར་འགྱུར་ལགས།
en: Blessed One, moreover, just as bodhisattvas are free from the darkness of delusion, may I too attain such an understanding of the path.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་རྒྱལ་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་དབང་གིས་བྱུང་བ།
en: The Blessed One responded to Nāga King Sāgara, “Nāga King, in this regard, bodhisattvas appear by the power of insight.

source: ཤེས་རབ་ཀྱི་སྒྲོན་མ་ལག་ན་ཐོགས་པ། ཤེས་རབ་ཀྱི་ཤེས་པ་ཅན། ཤེས་རབ་ཀྱི་སྔོན་དུ་འགྲོ་བ། ཤེས་རབ་ཀྱི་མཚོན་ཆ་ཅན། ཤེས་རབ་ཀྱིས་བྱ་བ་བྱེད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་ནས་སྦྱིན་པ་སྦྱིན་པར་བྱེད།
en: They bear the lamp of insight, have the knowledge of insight, are inspired by insight, have the weapon of insight, and perform actions based on insight.

source: ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད། བཟོད་པ་སྒོམ་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ་པར་བྱེད། བསམ་གཏན་སྙོམས་པར་འཇུག་པར་བྱེད། ཆོས་རྣམས་ལྷག་པར་མཐོང་བར་བྱེད།
en: While grounded in insight, bodhisattvas practice giving, maintain discipline, cultivate patience, engage in diligence, enter into concentration, see phenomena with special insight, and ripen beings.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །ཀླུའི་བདག་པོ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་ནས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ཅེ་ན།
en: “Nāga Lord, how then do bodhisattvas practice giving that is grounded in insight?

source: ཀླུའི་བདག་པོ་འདི་ལ་སྦྱིན་པ་མཉམ་པ་ཉིད་ཀྱིས་བདག་མཉམ་པ་ཉིད་དོ།
en: Nāga Lord, it is through the equality of giving that one arrives at the equality of self.

source: །བདག་མཉམ་པ་ཉིད་ཀྱིས་སེམས་ཅན་མཉམ་པ་ཉིད་དོ།
en: Through the equality of self, one arrives at the equality of beings.

source: །སེམས་ཅན་མཉམ་པ་ཉིད་ཀྱིས་ཆོས་མཉམ་པ་ཉིད་དོ།
en: Through the equality of beings, one arrives at the equality of phenomena.

source: །ཆོས་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དེ།
en: Through the equality of phenomena, one arrives at the equality of awakening.

source: མཉམ་པ་ཉིད་འདི་དག་ཀྱང་མི་སྤོང་ལ་སྦྱིན་པ་ཡང་སྦྱིན་པར་བྱེད་དེ།
en: They practice giving without losing these facets of equality.

source: སྦྱིན་པ་དེ་ཡང་ཉོན་མོངས་པའི་དབང་གིས་སྦྱིན་པར་མི་བྱེད་དོ།
en: This giving is not motivated by afflictions.

source: །དེས་དེ་ཇི་ལྟ་ཇི་ལྟར་ཡོངས་སུ་འཇལ་བ་དེ་ཁོ་ན་བཞིན་དུ་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་བྱེད་དེ།
en: It is only by comprehending this accurately that they are able to give up all the afflictive emotions.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་དང་། རྩོད་པ་ཐམས་ཅད་འདོར་བ་གང་ཡིན་པ་དེ་ནི་གཏོང་བའི་མཆོག་ཡིན་ཏེ།
en: So, giving up all afflictions, pacifying all views, and casting aside all disputes are the highest forms of generosity.

source: ཀླུའི་བདག་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའོ།
en: Nāga Lord, this is how a bodhisattva practices giving that is grounded in insight.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཞེ་ན།
en: “Nāga Lord, how then do bodhisattvas maintain discipline that is grounded in insight?

source: ལུས་དང་ངག་དང་སེམས་དབེན་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཡོངས་སུ་སྲུང་བ་སྟེ།
en: Perceiving body, speech, and mind in a void manner is maintaining discipline.

source: ལུས་དང་ངག་དང་སེམས་ལ་ཡང་མི་རྟེན།
en: They maintain discipline without relying on body, speech, or mind;

source: འཇིག་རྟེན་འདི་ལ་ཡང་མི་རྟེན། འཇིག་རྟེན་ཕ་རོལ་ལ་ཡང་མི་རྟེན།
en: without relying on this world or a future one;

source: ནང་ལ་ཡང་མི་རྟེན། ཕྱི་རོལ་ལ་ཡང་མི་རྟེན།
en: without relying on what is internal or external;

source: ཕུང་པོ་ལ་ཡང་མི་རྟེན། ཁམས་ལ་ཡང་མི་རྟེན། སྐྱེ་མཆེད་ལ་ཡང་མི་རྟེན།
en: without relying on the aggregates, the elements, or the sense sources;

source: བྱང་ཆུབ་ལ་ཡང་མི་རྟེན། མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་རྟེན།
en: without relying on awakening or nirvāṇa;

source: ཆོས་ཐམས་ཅད་ལ་ཡང་མི་རྟེན་པར་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་ལ།
en: and without relying on any phenomena.

source: ཚུལ་ཁྲིམས་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་ཤིན་ཏུ་རློམ་སེམས་སུ་མི་བྱེད་པ་འདི་ནི།
en: Their discipline does not make them arrogant or haughty.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་ཚུལ་ཁྲིམས་ཞེས་བྱའོ།
en: This is how bodhisattvas maintain discipline that is grounded in insight.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བཟོད་པ་གང་ཞེ་ན།
en: “What then is the bodhisattvas’ patience that is grounded in insight?
